org/20211202110014-reversible_jump_mcmc.org
:PROPERTIES:
:ID:       d430d6ab-03e8-4d26-b8c3-a4f8a3128cd7
:END:
#+title: Reversible-jump MCMC
#+filetags: :public:
#+LAST_MODIFIED: [2022-04-06 Wed 15:38]

- tags :: [[id:5acc4f0f-417e-424f-95a5-1c95e7e822ff][Markov Chain Monte Carlo]]

The Reversible-jump Markov Chain Monte Carlo (RJ-MCMC) algorithm is an extension of the Rosenbluth-Metropolis-Hastings algorithm where the number of dimensions of the parameter space is allowed to change.

And example of application (from Green 1995) is

#+begin_quote
the multiple changepoint model for Poisson model where the rate is supposed to be piecewise constant but changes an unknown number of times.
#+end_quote

* Frameworks

- In Julia the PPL [[https://www.gen.dev/][Gen]] implements RJ-MCMC
- In Python [[https://github.com/aesara-devs/aehmc][AeHMC]] plans to implement RJ-MCMC

* References
[[cite:&green1995]]
- [[id:2edff052-4f39-470a-a79f-eb8b8567467e][Reversible Jump Markov Chain Monte Carlo Computation and Bayesian Model Determination]] (Green 1995)
- [[id:fc3d3ba4-905f-4bf4-aaf0-b84ccac5b248][Involutive MCMC: a Unifying Framework]]
- [[id:16b18c5e-b7d9-4518-a1a0-86127265cf9d][Automating Involutive MCMC using Probabilistic and Differentiable Programming]]
