20211202110014-reversible_jump_mcmc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-02 Sun 19:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reversible-jump MCMC</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Reversible-jump MCMC</h1>
<dl class="org-dl">
<dt>tags</dt><dd><a href="20220306194751-markov_chain_monte_carlo_new.html#ID-5acc4f0f-417e-424f-95a5-1c95e7e822ff">Markov Chain Monte Carlo</a></dd>
</dl>

<p>
The Reversible-jump Markov Chain Monte Carlo (RJ-MCMC) algorithm is an extension of the Rosenbluth-Metropolis-Hastings algorithm where the number of dimensions of the parameter space is allowed to change.
</p>

<p>
And example of application (from Green 1995) is
</p>

<blockquote>
<p>
the multiple changepoint model for Poisson model where the rate is supposed to be piecewise constant but changes an unknown number of times.
</p>
</blockquote>

<div id="outline-container-org5850149" class="outline-2">
<h2 id="org5850149">Frameworks</h2>
<div class="outline-text-2" id="text-org5850149">
<ul class="org-ul">
<li>In Julia the PPL <a target='_blank' rel='noopener noreferrer' class='external' href="https://www.gen.dev/">Gen</a> implements RJ-MCMC</li>
<li>In Python <a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aehmc">AeHMC</a> plans to implement RJ-MCMC</li>
</ul>
</div>
</div>

<div id="outline-container-org6ffcd73" class="outline-2">
<h2 id="org6ffcd73">References</h2>
<div class="outline-text-2" id="text-org6ffcd73">
<p>

</p>
<ul class="org-ul">
<li><a href="20211202110901-reversible_jump_markov_chain_monte_carlo_computation_and_bayesian_model_determination.html#ID-2edff052-4f39-470a-a79f-eb8b8567467e">Reversible Jump Markov Chain Monte Carlo Computation and Bayesian Model Determination</a> (Green 1995)</li>
<li><a href="20211202111457-involutive_mcmc_a_unifying_framework.html#ID-fc3d3ba4-905f-4bf4-aaf0-b84ccac5b248">Involutive MCMC: a Unifying Framework</a></li>
<li><a href="20211202111517-automating_involutive_mcmc_using_probabilistic_and_differentiable_programming.html#ID-16b18c5e-b7d9-4518-a1a0-86127265cf9d">Automating Involutive MCMC using Probabilistic and Differentiable Programming</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf45680a" class="outline-2">
<h2 id="orgf45680a">Links to this note</h2>
<div class="outline-text-2" id="text-orgf45680a">
<ul class="org-ul">
<li><a href="./20211125144125-bayesian_statistics.html">Bayesian statistics</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
